# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11-OBB-P2: Enhanced OBB model with P2/4 detection layer for small object detection
# Specifically designed for remote sensing vehicle detection (15-20px targets)
# Adds stride-4 P2 layer for detecting ~45% of targets < 18px polygon_size

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-obb-p2.yaml' will call yolo11-obb-p2.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: ~232 layers, ~3.5M parameters, ~10.8 GFLOPs
  s: [0.50, 0.50, 1024] # summary: ~232 layers, ~12.6M parameters, ~36.5 GFLOPs
  m: [0.50, 1.00, 512]  # summary: ~290 layers, ~26.3M parameters, ~112 GFLOPs
  l: [1.00, 1.00, 512]  # summary: ~440 layers, ~32.9M parameters, ~142 GFLOPs
  x: [1.00, 1.50, 512]  # summary: ~440 layers, ~73.8M parameters, ~317 GFLOPs

# YOLO11n backbone (same as standard YOLO11)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n-p2 head: 4-scale detection (P2/4, P3/8, P4/16, P5/32)
head:
  # Top-down pathway (P5 -> P4 -> P3 -> P2)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12: cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15: cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 2], 1, Concat, [1]] # 18: cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 19 (P2/4-xsmall) **NEW P2 LAYER**

  # Bottom-up pathway (P2 -> P3 -> P4 -> P5)
  - [-1, 1, Conv, [128, 3, 2]] # 20
  - [[-1, 16], 1, Concat, [1]] # 21: cat head P3
  - [-1, 2, C3k2, [256, False]] # 22 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 23
  - [[-1, 13], 1, Concat, [1]] # 24: cat head P4
  - [-1, 2, C3k2, [512, False]] # 25 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 26
  - [[-1, 10], 1, Concat, [1]] # 27: cat head P5
  - [-1, 2, C3k2, [1024, True]] # 28 (P5/32-large)

  # Detection heads: P2/4, P3/8, P4/16, P5/32
  - [[19, 22, 25, 28], 1, OBB, [nc, 1]] # OBB(P2, P3, P4, P5)
